package ua.artcode.week1;

import java.util.Scanner;

/**
 * Created by IT on 26.06.2016.
 */
public class _01DataTypeIntro {
    public static void main(String[] args) {
        //целые числа
        //--------------------------------------------------------------
        byte b1 = 12;
        // 1 байт = 8 бит
        // 2^8 степень
        // 1 байт памяти
        // числа от -128 до 127

        short s1 = 30000;
        // 2 байта памяти
        // 2^16 степень
        // числа от -32,768 до 32,767

        int it = 23;
        // 4 байта памяти
        // 2^32 степень
        // числа от -2,147,483,648 до 2,147,483,647

        long l1 = 2343232322L;
        // 8 байта памяти
        // 2^64 степень
        // числа от -9,223,372,036,854,775,808 до 9,223,372,036,854,775,807


        //числа с плавающей точкой
        //--------------------------------------------------------------
        float f1 = 12.121121121F;
        // 4 байта памяти
        // 2^32 степень
        // числа от -2,147,483,648 до 2,147,483,647

        double d = 3.14;
        // 8 байта памяти
        // 2^64 степень
        // числа от -9,223,372,036,854,775,808 до 9,223,372,036,854,775,807
        //--------------------------------------------------------------

        //символы
        //--------------------------------------------------------------
        // 2 байта памяти
        // 2^16 степень
        // числа от -32,768 до 32,767
        char c1 = 'a';
        char c2 = '\u2432';
        char c3 = 123;

        //булево
        //-------------------------------------------------------------
        // 1 бит
        // числа 0 или 1
        boolean br = false;
        boolean br2 = false;

        //Переводим byte в short
        // b1 = 12
        short newshort = b1;
        System.out.println("View short " + newshort);


        //Переводим short в byte
        // s1 = 30000
        byte newbyte = (byte) s1;
        System.out.println("View short " + newbyte);


        //Ловим значения введеные с клавиатуры и выводим на экран
//        Scanner scanner = new Scanner(System.in);
//        String text = scanner.nextLine();
//        System.out.println(text);

        //Условия IF ELSE
        if ((br == true) || (br2= false)){
            System.out.println("Истина");
        }else{
            System.out.println("Ложь");
        }



    }
}
